# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install Binaries
brew 'antigen'
brew 'git'
brew 'hub'
brew 'fzf'
brew 'jq'
brew 'mas'
brew 'pidof'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'youtube-dl'
brew 'zplug'
brew 'zsh'

# Apps
cask '1password'
cask 'alfred'
cask 'bettertouchtool'
cask 'caffeine'
cask 'calibre'
cask 'chromium'
#cask 'docker'
cask 'gpg-suite'
cask 'evernote'
cask 'firefox-developer-edition'
cask 'google-backup-and-sync'
cask 'iterm2'
cask 'messenger-native'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'transmit'
cask 'visual-studio'
cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask 'font-iosevka-nerd-font'
cask 'font-iosevka'
