# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'

tap 'muesli/tap'
tap 'koekeishiya/formulae'

# Install Binaries
brew 'asciinema'
brew 'bat'
brew 'coreutils'
brew 'git'
brew 'gnu-sed'
brew 'hub'
brew 'findutils'
brew 'fzf'
brew 'jq'
brew 'mas'
brew 'neofetch'
brew 'neovim'
brew 'stow'
brew 'pidof'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'watch'
brew 'wget'
brew 'youtube-dl'
brew 'zplug'
brew 'zsh'

# Required by fonts
# https://github.com/Homebrew/homebrew-cask-fonts/issues/2000#issuecomment-613720275
brew 'svn'

# Apps
cask '1password'
cask 'alfred'
cask 'bettertouchtool'
cask 'caffeine'
cask 'calibre'
cask 'chromium'
cask 'colorsnapper'
cask 'daisydisk'
#cask 'docker'
cask 'discord'
cask 'drawio'
cask 'geogebra'
cask 'gpg-suite'
cask 'evernote'
cask 'firefox-developer-edition'
cask 'flux'
cask 'google-backup-and-sync'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keybase'
cask 'logitech-options'
cask 'messenger-native'
cask 'microsoft-teams'
cask 'monitorcontrol'
cask 'notion'
cask 'obs'
brew 'obs-cli'
cask 'obs-websocket'
cask 'slack'
cask 'spotify'
cask 'sweet-home3d'
cask 'plex'
cask 'plex-media-player'
cask 'postbox'
cask 'teamviewer'
cask 'telegram'
cask 'transmit'
cask 'tuxera-ntfs'
cask 'vuescan'
cask 'visual-studio'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Desktop environment
brew 'yabai'
brew 'skhd'
brew 'krp'

# Fonts
cask 'font-iosevka-nerd-font'
cask 'font-iosevka'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-merriweather'
cask 'font-roboto'
cask 'font-lato'
cask 'font-montserrat'


#############
# Dev stuff #
#############

tap 'heroku/brew'

# brew 'goenv'
# brew 'nodenv'
# brew 'rbenv'
# brew 'tfenv'

brew 'asdf'
brew 'awscli'
cask 'aws-vault'
brew 'azure-cli'
brew 'gron'
brew 'guumaster/tap/hostctl'
brew 'heroku'
#brew 'kail'
brew 'kind'
brew 'kubectl'
brew 'k9s'
brew 'lnav'
brew 'norwoodj/tap/helm-docs'
#brew 'stern'
brew 'vault'

cask 'jetbrains-toolbox'
cask 'ngrok'
cask 'sequel-pro'
cask 'google-cloud-sdk'


# Some tools
brew 'duf'
