# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'

# Install Binaries
brew 'asciinema'
#brew 'antigen'
brew 'coreutils'
brew 'git'
brew 'gnu-sed'
brew 'hub'
brew 'findutils'
brew 'fzf'
brew 'jq'
brew 'mas'
brew 'pidof'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'watch'
brew 'youtube-dl'
brew 'zplug'
brew 'zsh'

# Apps
cask '1password'
cask 'alfred'
cask 'bettertouchtool'
cask 'caffeine'
cask 'calibre'
cask 'chromium'
cask 'colorsnapper'
cask 'daisydisk'
#cask 'docker'
cask 'discord'
cask 'drawio'
cask 'geogebra'
cask 'gpg-suite'
cask 'evernote'
cask 'firefox-developer-edition'
cask 'google-backup-and-sync'
cask 'iterm2'
cask 'keybase'
cask 'logitech-options'
cask 'messenger-native'
cask 'microsoft-teams'
cask 'monitorcontrol'
cask 'notion'
cask 'slack'
cask 'spotify'
cask 'sweet-home3d'
cask 'plex-media-player'
cask 'postbox'
cask 'teamviewer'
cask 'telegram'
cask 'transmit'
cask 'tuxera-ntfs'
cask 'visual-studio'
cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask 'font-iosevka-nerd-font'
cask 'font-iosevka'
cask 'merriweather'
cask 'roboto'
cask 'lato'
cask 'montserrat'
